In [37]:
import numpy as np
import pandas as pd

pd.set_option('display.max_columns', None)

# Duplicate Rows

In [38]:
data = pd.DataFrame({
    "k1": ["one", "two"] * 3 + ["two"],
    "k2": [1, 1, 2, 3, 3, 4, 4]
})

data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [39]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [40]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [41]:
data.drop_duplicates(subset=["k1"])

    k1  k2
0  one   1
1  two   1

# Map Values

In [42]:
data = pd.DataFrame({
    "food": ["bacon", "pulled pork", "bacon", "pastrami", "corned beef", "bacon", "pastrami", "honey ham", "nova lox"],
    "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]
})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [43]:
meat_to_animal = {
     "bacon": "pig",
     "pulled pork": "pig",
     "pastrami": "cow",
     "corned beef": "cow",
     "honey ham": "pig",
     "nova lox": "salmon"
}

In [44]:
data["animal"] = data["food"].map(meat_to_animal)

In [45]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

# Replacing Values

In [46]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [47]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [48]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# Binning

In [49]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

## Explicit Bins

In [50]:
# Letâ€™s divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older.
bins = [18, 25, 35, 60, 100]

In [51]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [52]:
age_categories = pd.cut(ages, bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [53]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

## Equal-Length Bins

In [54]:
data = np.random.uniform(size=20)
data

array([0.07137828, 0.85384473, 0.56251424, 0.16060323, 0.21840844,
       0.74764586, 0.05794951, 0.89880009, 0.75672386, 0.58453588,
       0.31953185, 0.41668513, 0.7900383 , 0.82514929, 0.39296724,
       0.78953842, 0.98994501, 0.95814787, 0.43079607, 0.18183641])

In [55]:
#  The precision=2 option limits the decimal precision to two digits.
pd.cut(data, bins=4, precision=2)

[(0.057, 0.29], (0.76, 0.99], (0.52, 0.76], (0.057, 0.29], (0.057, 0.29], ..., (0.76, 0.99], (0.76, 0.99], (0.76, 0.99], (0.29, 0.52], (0.057, 0.29]]
Length: 20
Categories (4, interval[float64, right]): [(0.057, 0.29] < (0.29, 0.52] < (0.52, 0.76] < (0.76, 0.99]]

## Equal-Size Bins

In [56]:
data = np.random.standard_normal(1000)

In [57]:
quartiles = pd.qcut(data, q=4, precision=2)
quartiles

[(0.02, 0.66], (0.02, 0.66], (-2.5799999999999996, -0.67], (0.66, 2.66], (0.02, 0.66], ..., (0.66, 2.66], (0.66, 2.66], (0.02, 0.66], (-2.5799999999999996, -0.67], (-0.67, 0.02]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.5799999999999996, -0.67] < (-0.67, 0.02] < (0.02, 0.66] < (0.66, 2.66]]

In [58]:
quartiles.value_counts()

(-2.5799999999999996, -0.67]    250
(-0.67, 0.02]                   250
(0.02, 0.66]                    250
(0.66, 2.66]                    250
Name: count, dtype: int64

# Detecting and Filtering Outliers

In [59]:
data = pd.DataFrame(
    np.random.standard_normal((1000, 4)),
    columns=['a', 'b', 'c', 'd']
)

In [60]:
data.describe()

                 a            b            c            d
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.044414     0.024139     0.005105     0.006927
std       0.991539     1.038066     0.984220     1.023213
min      -3.068889    -3.413041    -3.423467    -3.493752
25%      -0.624180    -0.705338    -0.639008    -0.717207
50%       0.065375     0.026494    -0.034218    -0.018239
75%       0.726956     0.742050     0.666311     0.715567
max       3.143138     2.830778     3.816718     3.493162

In [61]:
# pick a random col
col = data['c']
col.head()

0    1.408887
1    0.786890
2    0.309433
3   -0.724626
4   -0.906984
Name: c, dtype: float64

In [62]:
# we want all vals here to be greater than absolute 2
# lets find the outliers
col[col.abs() > 2].head()

12    2.296376
25   -2.010538
33    2.284117
68    2.351025
81    2.738097
Name: c, dtype: float64

In [64]:
(data[data.abs() > 1]).head()

          a         b         c         d
0       NaN -1.126844  1.408887 -1.559583
1       NaN       NaN       NaN       NaN
2       NaN       NaN       NaN       NaN
3  1.886815       NaN       NaN       NaN
4       NaN       NaN       NaN       NaN

In [29]:
(data[(data.abs() > 2).any(axis="columns")]).head()

           a         b         c         d
10 -1.035650  3.113520 -1.103360 -1.404034
12  0.518048  0.166649  0.743578 -2.920598
24  0.645241 -2.426849  1.704093  0.929254
27 -2.223195 -0.961401  0.665169  0.803767
29 -0.398020 -1.419210  2.188672 -0.126628

In [65]:
np.sign(data).head()

     a    b    c    d
0  1.0 -1.0  1.0 -1.0
1  1.0  1.0  1.0  1.0
2 -1.0 -1.0  1.0  1.0
3  1.0  1.0 -1.0 -1.0
4  1.0 -1.0 -1.0 -1.0

In [30]:
data[data.abs() > 2] = np.sign(data) * 2

In [31]:
data.describe()

                 a            b            c            d
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.007061    -0.010263     0.039507     0.002708
std       0.955593     0.930113     0.984901     0.970679
min      -2.000000    -2.000000    -2.000000    -2.000000
25%      -0.654121    -0.640329    -0.679161    -0.707927
50%      -0.029053    -0.008356     0.089279     0.020183
75%       0.686674     0.659962     0.711101     0.674943
max       2.000000     2.000000     2.000000     2.000000

# Dummy Variables

In [32]:
df = pd.DataFrame({
    "key": ["b", "b", "a", "c", "a", "b"], 
    "col": range(6)
})

df

  key  col
0   b    0
1   b    1
2   a    2
3   c    3
4   a    4
5   b    5

In [33]:
dummies = pd.get_dummies(df["key"], prefix="key")
dummies

   key_a  key_b  key_c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [36]:
df_with_dummy = df[["col"]].join(dummies)
df_with_dummy

   col  key_a  key_b  key_c
0    0  False   True  False
1    1  False   True  False
2    2   True  False  False
3    3  False  False   True
4    4   True  False  False
5    5  False   True  False